export const faculties = [
  "БрГУ-ППФ: Психология",
  "БрГУ-ИФ: Историческое образование",
  "БрГУ-ФМФ: Физико-математическое образование",
  "БрГУ-СПФ: Социально-педагогическое и психологическое образование",
  "БрГУ-ФЕ: Природоведческое образование",
  "БрГУ-ФФВиС: Физическая культура",
  "БрГУ-ФФ: Русская филология",
  "БрГУ-ФИЯ: Современные иностранные языки",
  "БрГУ-ЮФ: Правоведение",
  "БрГТУ-МСФ: Автоматизация технологических процессов",
  "БрГТУ-ЭФ: Бухгалтерский учет и аудит",
  "БрГТУ-ФЭИС: Искусственный интеллект",
  "БрГТУ-АСФ: Строительство зданий и сооружений",
  "БрГТУ-ФИСЭ: Мелиорация и водное хозяйство"
];

export type Student = [number[], number]

export const students: Student[] = [
  [[1.00, 0.10, 0.30, 0.50, 0.70, 0.20, 0.60, 0.40, 0.90, 0.80, 0.70, 0.50, 0.30, 0.20, 0.3], 0], // БрГУ: Психология
  [[0.10, 1.00, 0.20, 0.40, 0.60, 0.50, 0.80, 0.30, 0.70, 0.90, 0.60, 0.40, 0.50, 0.10, 0.8], 1], // БрГУ: Историческое образование
  [[0.20, 0.30, 1.00, 0.10, 0.40, 0.60, 0.50, 0.70, 0.90, 0.80, 0.20, 0.60, 0.40, 0.50, 0.6], 2], // БрГУ: Физико-математическое образование
  [[0.30, 0.40, 0.20, 1.00, 0.10, 0.60, 0.50, 0.80, 0.40, 0.70, 0.90, 0.50, 0.60, 0.20, 0.4], 3], // БрГУ: Социально-педагогическое и психологическое образование
  [[0.40, 0.50, 0.10, 0.30, 1.00, 0.70, 0.60, 0.20, 0.50, 0.80, 0.70, 0.40, 0.90, 0.30, 0.9], 4], // БрГУ: Природоведческое образование
  [[0.50, 0.60, 0.40, 0.20, 0.30, 1.00, 0.70, 0.50, 0.30, 0.90, 0.40, 0.80, 0.10, 0.60, 0.78], 5], // БрГУ: Физическая культура
  [[0.60, 0.70, 0.50, 0.60, 0.20, 0.40, 1.00, 0.30, 0.80, 0.50, 0.20, 0.10, 0.70, 0.40, 0.3], 6], // БрГУ: Русская филология
  [[0.70, 0.80, 0.60, 0.50, 0.30, 0.20, 0.10, 1.00, 0.70, 0.40, 0.50, 0.30, 0.60, 0.90, 0.6], 7], // БрГУ: Современные иностранные языки
  [[0.80, 0.90, 0.70, 0.40, 0.60, 0.10, 0.30, 0.50, 1.00, 0.20, 0.80, 0.60, 0.40, 0.10, 0.96], 8], // БрГУ: Правоведение
  [[0.90, 0.50, 0.80, 0.70, 0.10, 0.30, 0.40, 0.60, 0.20, 1.00, 0.10, 0.50, 0.70, 0.20, 0.2], 9], // БрГТУ: Автоматизация технологических процессов
  [[0.30, 0.40, 0.20, 0.60, 0.50, 0.70, 0.10, 0.90, 0.30, 0.80, 1.00, 0.20, 0.90, 0.60, 0.9], 10], // БрГТУ: Бухгалтерский учет и аудит
  [[0.50, 0.20, 0.40, 0.10, 0.60, 0.80, 0.30, 0.90, 0.50, 0.70, 0.30, 1.00, 0.20, 0.10, 0.8], 11], // БрГТУ: Искусственный интеллект
  [[0.60, 0.10, 0.50, 0.20, 0.40, 0.30, 0.90, 0.10, 0.80, 0.50, 0.60, 0.20, 1.00, 0.40, 0.5], 12], // БрГТУ: Строительство зданий и сооружений
  [[0.10, 0.60, 0.30, 0.40, 0.20, 0.10, 0.80, 0.20, 0.40, 0.60, 0.90, 0.50, 0.70, 1.00, 0.4], 13]  // БрГТУ: Мелиорация и водное хозяйство
];
